# Pandas Basic Assignment

### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [3]:
import pandas as pd

In [10]:
data = [4, 8, 15, 16, 23, 42]
my_data = pd.Series(data)
my_data

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [12]:
data = [4, 8, 15, 16, 23, 42, 23, 22, 65, 75]
ser = pd.Series(data)
print(ser)

0     4
1     8
2    15
3    16
4    23
5    42
6    23
7    22
8    65
9    75
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

| Name | Age | Gender |
|:----:|:---:|:------:|
| Alice | 25 | Female |
| Bob| 30 | Male |
| Clair | 27 | Female |


Then, print the DataFrame.

In [16]:
data = [
    { "Name": "Alice", "Age": "25", "Gender": "Female"},
    { "Name": "Bob", "Age": "30", "Gender": "Male"},
    { "Name": "Clair", "Age": "27", "Gender": "Female"}
]
df = pd.DataFrame(data)
df

    Name Age  Gender
0  Alice  25  Female
1    Bob  30    Male
2  Clair  27  Female

### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Pandas DataFrame is two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns). A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns. Pandas DataFrame consists of three principal components, the data, rows, and columns.

Pandas Series is a 1D array of data, but a single-column DataFrame is a 2D table with one column. The main distinction between the two is this. For a single-column DataFrame, an index can be optional, but a Series has to have an index defined.

In [4]:
data = [4, 8, 15, 16, 23, 42, 23, 22, 65, 75]
ser = pd.Series(data)
print(ser)

0     4
1     8
2    15
3    16
4    23
5    42
6    23
7    22
8    65
9    75
dtype: int64

In [7]:
data = [
    { "Name": "Alice", "Age": "25", "Gender": "Female"},
    { "Name": "Bob", "Age": "30", "Gender": "Male"},
    { "Name": "Clair", "Age": "27", "Gender": "Female"}
]
df = pd.DataFrame(data)
df

    Name Age  Gender
0  Alice  25  Female
1    Bob  30    Male
2  Clair  27  Female

### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

Below are the common functions used in to manipulate data in data frame:
- melt
- pivot
- pivot_table
- Merge 
- cut

In [20]:
pd.melt(df, id_vars =['Name'], value_vars =['Age'])

    Name variable value
0  Alice      Age    25
1    Bob      Age    30
2  Clair      Age    27

### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

All of them are mutable.

### Q7. Create a DataFrame using multiple Series. Explain with an example.

In [23]:
emp_ids = pd.Series([121, 122, 123, 124, 125])
emp_names = pd.Series(["A", "B", "C", "D", "E"])
emp_location = pd.Series(["London", "Mumbai", "Pune", "New York", "Berlin"])

df_ser = pd.DataFrame({
    "Employee Id": emp_ids,
    "Employee Names": emp_names,
    "Employee Location": emp_location
})

df_ser

   Employee Id Employee Names Employee Location
0          121              A            London
1          122              B            Mumbai
2          123              C              Pune
3          124              D          New York
4          125              E            Berlin